# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "mas"

# Brew
## Shell
brew "zsh"
brew "bash"

## GNU Tools
brew "findutils"
brew "coreutils"
brew "gawk"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "global"

## Base
brew "git"
brew "tree"
brew "grep"
brew "tree"
brew "tmux"

## Extra Base
brew "git-extras"
brew "fd"
brew "ack"
brew "the_silver_searcher"
brew "ripgrep"
brew "rename"
brew "tig"
brew "stow"
brew "fzf"
brew "bat"
brew "fd"
brew "fzf"
brew "jq"
brew "tldr"
brew "macvim"

## Font
brew "font-hack-nerd-font"
brew "font-source-code-pro"

# BrewCask
cask "alfred"
cask "google-chrome"
cask "bettertouchtool"
cask "hammerspoon"
cask "mounty"
cask "appcleaner"

## Dev
cask "iterm2"
cask "visual-studio-code"
cask "typora"
cask "macdown"
cask "charles"
cask "db-browser-for-sqlite"
cask "beyond-compare"
cask "dash"
cask "fork"
cask "sublime-text"
cask "sublime-merge"

## Fun
cask "movist-pro"

## Quicklook
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "qlstephen"
cask "qlimagesize"

## ScreenSaver
cask "brooklyn"

# Mas

mas "超级右键 专业版", id 1550403011
mas "网易邮箱大师", id 1233593954
mas "网易云音乐", id  944848654
mas "Actions", id 1586435171
mas "Amphetamine", id  937984704
mas "Audio Jam", id 1588219090
mas "Bob", id 1630034110
mas "Boop", id 1518425043
mas "Days Matter", id  494500492
mas "Developer", id  640199958
mas "Dropover", id 1355679052
mas "Easy CSV Editor", id 1171346381
mas "Expressions", id  913158085
mas "Folder Preview", id 6698876601
mas "Gapplin", id  768053424
mas "Gifski", id 1351639930
mas "Hex Fiend", id 1342896380
mas "iHash", id  763902043
mas "Key Codes", id  414568915
mas "Keynote讲演", id  409183694
mas "LocalSend", id 1661733229
mas "MindNode Classic", id 1289197285
mas "Numbers表格", id  409203825
mas "Octotree", id 1457450145
mas "OK JSON", id 1576121509
mas "Pages文稿", id  409201541
mas "Pandan", id 1569600264
mas "Paste", id  967805235
mas "Picview", id 6452016140
mas "Pixelmator Pro", id 1289583905
mas "Pixiu", id 1461452315
mas "SnippetsLab", id 1006087419
mas "Soulver 3", id 1508732804
mas "SQLiteFlow", id 1378587993
mas "Tab Space", id 1473726602
mas "Tayasui Sketches", id 1178074963
mas "TextSniper", id 1528890965
mas "The Unarchiver", id  425424353
mas "Things", id  904280696
mas "Vimari", id 1480933944
mas "Xcode", id  497799835
mas "Xmind", id 1327661892