# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/cask-cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "zsh"
brew "bash"

# GNU Tools
brew "findutils"
brew "coreutils"
brew "gawk"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "global"

brew "mas"
brew "macvim", args: ["with-override-system-vim", "with-python3"]
brew "the_silver_searcher"
brew "ack"
brew "the_silver_searcher"
brew "ripgrep"
brew "tree"
brew "grep"
brew "rename"
brew "tig"
brew "stow"
brew "tmux"
brew "fzf"
brew "jenv"
brew "diff-so-fancy"
brew "bat"
brew "fd"
brew "fzf"
brew "jq"
brew "tig"
brew "tldr"
brew "tree"

# Apps
cask "iterm2"
cask "gitup"
cask "beyond-compare"
cask "dash"
cask "google-chrome"

# Quicklook
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "qlstephen"
cask "qlimagesize"

# Mac App Store apps
mas "iHash", id 763902043
mas "QQ", id 451108668
mas "XMind", id 1327661892
mas "Reeder", id 880001334
mas "Xcode", id 497799835
mas "Fantastical", id 975937182
mas "Key Codes", id 414568915
mas "滴答清单", id 966085870
mas "Pixelmator Pro", id 1289583905
mas "QQ音乐", id 595615424
mas "The Unarchiver", id 425424353
mas "WPS Office", id 1443749478
mas "SnippetsLab", id 1006087419
mas "Time Out", id 402592703
mas "Text Scanner", id 1452523807
mas "Xnip", id 1221250572
mas "QSpace", id 1469774098
mas "Manico", id 724472954
mas "网易邮箱大师", id 1233593954
mas "Xee³", id 639764244
mas "Expressions", id 913158085
mas "欧路词典", id 434350458
mas "Gapplin", id 768053424
mas "App Icon Gear", id 989646576
mas "Boop", id 1518425043
mas "Pages 文稿", id 409201541
mas "Jayson", id 1189824719
mas "Numbers 表格", id 409203825
mas "Paste", id 967805235
mas "熊掌记", id 1091189122
mas "Keynote 讲演", id 409183694
