# Brew
## Tools
brew "mycli"
brew "pgcli"
brew "jenv"
brew "noti"
brew "imagemagick"
brew "ffmpeg"

## Dev
brew "cmake"

## DB
brew "postgresql"
brew "mysql"
brew "sqlite"

## Lang
brew "elixir"
brew "go"
brew "nginx"
brew "lua"

## OTP(One-Time-Password)
brew "gnupg"
brew "oath-toolkit"

# BrewCask
cask "docker"

# Mas
mas "企业微信", id 1189898970
